[{
        "name": "Perfect Logic",
        "url": "https://cupidmobi.com/perfect-logic-game",
        "img": "Perfect_Logic.jpg",
        "description": "Perfect Logic is a brain-twisting puzzle game where you arrange shapes to fill a grid without overlapping. With its simple rules and challenging puzzles, it's a great way to sharpen your logic and spatial reasoning skills while having fun."
    },
    {
        "name": "Racer",
        "url": "https://cupidmobi.com/racer-game",
        "img": "Racer.jpg",
        "description": "Racer is an adrenaline-fueled racing game where you compete against other drivers in high-speed races across diverse tracks. With its realistic graphics and intense competition, it delivers an immersive racing experience that will get your heart pounding."
    },
    {
        "name": "Car Racing Speed",
        "url": "https://cupidmobi.com/car-racing-speed-app",
        "img": "Car_Racing_Speed.jpg",
        "description": "Car Racing Speed puts you behind the wheel of high-speed racing cars as you compete in adrenaline-fueled races. With realistic physics, stunning graphics, and intense competition, it delivers an immersive racing experience for enthusiasts of all ages."
    },
    {
        "name": "Brain implants are closer than you might think...",
        "url": "https://cupidmobi.com/brain-implants-are-closer-than-you-might-think-video",
        "img": "Brain_implants_are_closer_than_you_might_think....jpg",
        "description": "Brain implants are advancing rapidly, bringing us closer to a future where humans can augment their cognitive abilities and interface directly with technology. With ongoing research and development, these implants hold the potential to revolutionize healthcare, communication, and human-computer interaction."
    },
    {
        "name": "One man's mission to get the wheels turning in Colombia",
        "url": "https://cupidmobi.com/one-mans-mission-to-get-the-wheels-turning-in-colombia-video",
        "img": "One_man's_mission_to_get_the_wheels_turning_in_Colombia.jpg",
        "description": "Follow one man's mission to bring bicycles to rural communities in Colombia, providing access to transportation and empowering individuals to improve their lives. With determination and dedication, he's transforming lives and building a brighter future for generations to come."
    },
    {
        "name": "Marbles Garden",
        "url": "https://cupidmobi.com/marbles-garden-app",
        "img": "Marbles_Garden.jpg",
        "description": "Marbles Garden is a delightful puzzle game where you arrange marbles to create beautiful patterns in a tranquil garden setting. With its soothing music and meditative gameplay, it's the perfect way to relax and unwind after a long day."
    },
    {
        "name": "Christmas Gift Shoot",
        "url": "https://cupidmobi.com/christmas-gift-shoot-app",
        "img": "Christmas_Gift_Shoot.jpg",
        "description": "Christmas Gift Shoot is a festive shooting game where you take aim at colorful presents to spread holiday cheer. With cheerful Christmas music and cheerful graphics, it's a merry way to celebrate the season of giving."
    },
    {
        "name": "Billiards",
        "url": "https://cupidmobi.com/billiards-game",
        "img": "Billiards.jpg",
        "description": "Billiards is a classic game of skill and precision where you use a cue stick to pocket colored balls on a felt-covered table. With realistic physics and immersive gameplay, it's a timeless pastime that's perfect for both casual players and experienced pool sharks."
    },
    {
        "name": "Photo Editor Application",
        "url": "https://cupidmobi.com/photo-editor-application-app",
        "img": "Photo_Editor_Application.jpg",
        "description": "The Photo Editor Application is a versatile and user-friendly tool for editing and enhancing your photos. With its intuitive interface and diverse selection of editing options, it empowers you to transform ordinary snapshots into stunning works of art."
    },
    {
        "name": "An Influencer's Calling 'Everyone had to accept me when I accepted myself'",
        "url": "https://cupidmobi.com/an-influencers-calling-everyone-had-to-accept-me-when-i-accepted-myself-video",
        "img": "An_Influencer's_Calling_'Everyone_had_to_accept_me_when_I_accepted_myself'.jpg",
        "description": "An influencer shares her journey of self-discovery and acceptance, inspiring others to embrace their true selves and find confidence in their uniqueness. With authenticity and vulnerability, she encourages her followers to let go of societal expectations and embrace their individuality with pride."
    },
    {
        "name": "Shadow Ninja",
        "url": "https://cupidmobi.com/shadow-ninja-game",
        "img": "Shadow_Ninja.jpg",
        "description": "Shadow Ninja is an action-packed platformer game where you step into the shoes of a skilled ninja on a mission to defeat evil forces and restore peace to the land. With fast-paced gameplay, fluid controls, and challenging levels, it's a thrilling adventure for ninja enthusiasts."
    },
    {
        "name": "Sights with Heights Ghana’s national park canopy walk",
        "url": "https://cupidmobi.com/sights-with-heights-ghanas-national-park-canopy-walk-video",
        "img": "Sights_with_Heights_Ghana’s_national_park_canopy_walk.jpg",
        "description": "Experience the breathtaking beauty of Ghana's national parks from a new perspective with a thrilling canopy walk high above the forest floor. As you traverse the suspended bridges and platforms, you'll have a unique opportunity to observe the rich biodiversity of the rainforest canopy."
    },
    {
        "name": "Sheep Fight",
        "url": "https://cupidmobi.com/sheep-fight-game",
        "img": "Sheep_Fight.jpg",
        "description": "Sheep Fight is a hilarious multiplayer brawler game where you engage in chaotic battles as adorable sheep armed with various weapons. With its whimsical visuals and frantic gameplay, it's a sheep-tastic showdown that's guaranteed to leave you laughing."
    },
    {
        "name": "Green Dino Run",
        "url": "https://cupidmobi.com/green-dino-run-app",
        "img": "Green_Dino_Run.jpg",
        "description": "Green Dino Run is an addictive endless runner game starring a cute green dinosaur on a quest for survival. Navigate through obstacles, collect coins, and see how far you can run in this fast-paced and exciting adventure."
    },
    {
        "name": "The Getaway",
        "url": "https://cupidmobi.com/the-getaway-app",
        "img": "The_Getaway.jpg",
        "description": "The Getaway is a thrilling action game where you embark on a high-speed chase through the city streets. Dodge obstacles, outrun the cops, and pull off daring maneuvers as you make your getaway in this adrenaline-pumping adventure."
    },
    {
        "name": "Vegan Ice Cream Banana Matcha",
        "url": "https://cupidmobi.com/vegan-ice-cream-banana-matcha-video",
        "img": "Vegan_Ice_Cream_Banana_Matcha.jpg",
        "description": "Discover the refreshing taste of banana matcha vegan ice cream, made with ripe bananas and antioxidant-rich matcha powder. With its vibrant green color and subtle earthy flavor, it's a healthy and delicious treat that's perfect for cooling off on a hot day."
    },
    {
        "name": "This Dutch parade takes flower power to the next level",
        "url": "https://cupidmobi.com/this-dutch-parade-takes-flower-power-to-the-next-level-video",
        "img": "This_Dutch_parade_takes_flower_power_to_the_next_level.jpg",
        "description": "Experience the colorful spectacle of the Dutch flower parade, where elaborate floats adorned with millions of blooms parade through the streets in a celebration of spring and floral beauty. From towering tulips to cascading daffodils, this annual event showcases the Netherlands' rich horticultural heritage in all its glory."
    },
    {
        "name": "Earth Attack",
        "url": "https://cupidmobi.com/earth-attack-game",
        "img": "Earth_Attack.jpg",
        "description": "Earth Attack is an intense action game where you defend the planet against waves of alien invaders. With powerful weapons, strategic upgrades, and relentless enemies, it's a thrilling battle for survival that will put your shooting skills to the test."
    },
    {
        "name": "Open This Pen",
        "url": "https://cupidmobi.com/open-this-pen-video",
        "img": "Open_This_Pen.jpg",
        "description": "Unleash your creativity and unlock your potential with this innovative pen that's designed to inspire and empower. With its sleek design and smooth writing experience, it's the perfect tool for jotting down ideas, sketching out designs, or simply doodling your way to inspiration and enlightenment."
    },
    {
        "name": "Money Falling",
        "url": "https://cupidmobi.com/money-falling-video",
        "img": "Money_Falling.jpg",
        "description": "Experience the thrill of a windfall as money rains down from the sky in this mesmerizing image of falling currency. With its symbolic representation of wealth and abundance, it's a visual reminder of the possibilities and opportunities that await those who dare to dream and pursue their goals."
    },
    {
        "name": "Insta Restaurant We could all use a bit more pink in our lives",
        "url": "https://cupidmobi.com/insta-restaurant-we-could-all-use-a-bit-more-pink-in-our-lives-video",
        "img": "Insta_Restaurant_We_could_all_use_a_bit_more_pink_in_our_lives.jpg",
        "description": "Step into the whimsical world of the Insta Restaurant, where every corner is a feast for the eyes with its vibrant pink decor and playful touches. From its rose-colored walls and fluffy pink chairs to its Instagram-worthy dishes and cocktails, it's a dining experience that's sure to brighten your day and your feed."
    },
    {
        "name": "Forsake The Rake",
        "url": "https://cupidmobi.com/forsake-the-rake-game",
        "img": "Forsake_The_Rake.jpg",
        "description": "Forsake The Rake is a terrifying horror game where you must survive the night in a dark forest infested with the malevolent creature known as the Rake. With its atmospheric tension and relentless pursuit, it's a heart-pounding experience that will haunt your dreams."
    },
    {
        "name": "Christmas Home Decoration Game",
        "url": "https://cupidmobi.com/christmas-home-decoration-game-app",
        "img": "Christmas_Home_Decoration_Game.jpg",
        "description": "Christmas Home Decoration Game lets you unleash your creativity as you decorate your own festive holiday home. From twinkling lights to cozy fireplaces, it's your chance to create a winter wonderland that's perfect for celebrating the holiday season."
    },
    {
        "name": "Flow Slider",
        "url": "https://cupidmobi.com/flow-slider-app",
        "img": "Flow_Slider.jpg",
        "description": "Flow Slider is a captivating puzzle game where you slide tiles to create a continuous flow of color. With its serene visuals and soothing gameplay, it's the perfect way to relax and unwind as you immerse yourself in the art of fluid motion."
    },
    {
        "name": "Block Puzzle",
        "url": "https://cupidmobi.com/block-puzzle-app",
        "img": "Block_Puzzle.jpg",
        "description": "Block Puzzle is a classic puzzle game that challenges you to fit different-shaped blocks together to form complete rows. With simple yet addictive gameplay, it's a timeless brain-teaser that will keep you entertained for hours."
    },
    {
        "name": "Winning Formula",
        "url": "https://cupidmobi.com/winning-formula-game",
        "img": "Winning_Formula.jpg",
        "description": "Winning Formula is a strategic sports management game where you build and manage your own racing team. With its detailed simulation and immersive gameplay, it's your chance to experience the thrill of motorsport from the comfort of your own smartphone."
    },
    {
        "name": "Platform Games Zombies vs Dracula Hunting Edition",
        "url": "https://cupidmobi.com/platform-games-zombies-vs-dracula-hunting-edition-game",
        "img": "Platform_Games_Zombies_vs_Dracula_Hunting_Edition.jpg",
        "description": "Platform Games: Zombies vs Dracula Hunting Edition is an action-packed platformer game where you battle hordes of zombies and vampires in a quest to save humanity. With its challenging levels and retro-inspired gameplay, it's a thrilling adventure that will keep you on the edge of your seat."
    },
    {
        "name": "How to Photo Transfer Anything Screen printing made easy",
        "url": "https://cupidmobi.com/how-to-photo-transfer-anything-screen-printing-made-easy-video",
        "img": "How_to_Photo_Transfer_Anything_Screen_printing_made_easy.jpg",
        "description": "Master the art of screen printing with this comprehensive guide to photo transfer techniques. From selecting the right materials to creating your own custom designs, you'll learn everything you need to know to create professional-quality prints with ease and precision."
    },
    {
        "name": "KFC is testing meatless chicken wings and nuggets",
        "url": "https://cupidmobi.com/kfc-is-testing-meatless-chicken-wings-and-nuggets-video",
        "img": "KFC_is_testing_meatless_chicken_wings_and_nuggets.jpg",
        "description": "Get ready to sink your teeth into meatless chicken wings and nuggets, as KFC announces plans to test plant-based alternatives in select markets. Made with a blend of herbs, spices, and plant-based proteins, these meatless options promise the same finger-lickin' good flavor without the meat."
    },
    {
        "name": "Tower Platformer",
        "url": "https://cupidmobi.com/tower-platformer-game",
        "img": "Tower_Platformer.jpg",
        "description": "Tower Platformer is a challenging platform game set in a mystical tower filled with traps and obstacles. With precise jumps, quick reflexes, and strategic thinking, you must navigate through each level to reach the top and uncover the tower's secrets."
    },
    {
        "name": "Slenderman Must Die Abandoned Graveyard",
        "url": "https://cupidmobi.com/slenderman-must-die-abandoned-graveyard-game",
        "img": "Slenderman_Must_Die_Abandoned_Graveyard.jpg",
        "description": "Slenderman Must Die Abandoned Graveyard is a spine-chilling horror game where you must survive the night in a haunted graveyard while being stalked by the eerie Slenderman. With its eerie atmosphere and tense gameplay, it's a heart-pounding experience that will keep you on the edge of your seat."
    },
    {
        "name": "Stickman Warriors",
        "url": "https://cupidmobi.com/stickman-warriors-app",
        "img": "Stickman_Warriors.jpg",
        "description": "Stickman Warriors pits you against hordes of enemy stick figures in epic battles of skill and strategy. With a variety of weapons and power-ups at your disposal, it's up to you to lead your stickman army to victory in this action-packed combat game."
    },
    {
        "name": "City Innovations The higher you go, the greener it gets",
        "url": "https://cupidmobi.com/city-innovations-the-higher-you-go-the-greener-it-gets-video",
        "img": "City_Innovations_The_higher_you_go,_the_greener_it_gets.jpg",
        "description": "Explore the innovative urban designs that are transforming cities into green spaces, with lush rooftop gardens and vertical forests that thrive high above the city streets. As cities strive to become more sustainable and environmentally friendly, these green innovations are paving the way for a greener future."
    },
    {
        "name": "Cooking Madness",
        "url": "https://cupidmobi.com/cooking-madness-app",
        "img": "Cooking_Madness.jpg",
        "description": "Cooking Madness is a fast-paced cooking game where you prepare delicious dishes for hungry customers. From burgers to sushi, it's your chance to showcase your culinary skills and become a master chef in this addictive cooking simulation."
    },
    {
        "name": "Nova Xonix 3D",
        "url": "https://cupidmobi.com/nova-xonix-3d-game",
        "img": "Nova_Xonix_3D.jpg",
        "description": "Nova Xonix 3D is a modern twist on the classic arcade game where you carve out territory while avoiding enemies and obstacles. With its sleek 3D graphics and addictive gameplay, it offers a fresh take on a beloved retro game."
    },
    {
        "name": "Salsas for Sunny Days Spicy mango salsa",
        "url": "https://cupidmobi.com/salsas-for-sunny-days-spicy-mango-salsa-video",
        "img": "Salsas_for_Sunny_Days_Spicy_mango_salsa.jpg",
        "description": "Add a kick to your summer dishes with this vibrant and flavorful spicy mango salsa. Made with ripe mangoes, jalapeños, cilantro, and lime juice, it's the perfect accompaniment to grilled meats, tacos, or simply enjoyed with tortilla chips for a refreshing and zesty snack."
    },
    {
        "name": "Fruit Slice",
        "url": "https://cupidmobi.com/fruit-slice-game",
        "img": "Fruit_Slice.jpg",
        "description": "Fruit Slice is a fast-paced arcade game where you slice and dice through a variety of juicy fruits while avoiding bombs and obstacles. With its addictive gameplay and colorful graphics, it's a fruity frenzy that's perfect for satisfying your slicing cravings."
    },
    {
        "name": "Doodle God Fantasy World Of Magic",
        "url": "https://cupidmobi.com/doodle-god-fantasy-world-of-magic-app",
        "img": "Doodle_God_Fantasy_World_Of_Magic.jpg",
        "description": "Doodle God Fantasy World Of Magic lets you play as the almighty creator, combining elements to form a fantastical world of magic and wonder. Unleash your imagination as you experiment with different combinations and watch your creations come to life in this enchanting puzzle game."
    },
    {
        "name": "Storm Shadow Runner",
        "url": "https://cupidmobi.com/storm-shadow-runner-game",
        "img": "Storm_Shadow_Runner.jpg",
        "description": "Storm Shadow Runner is an adrenaline-fueled parkour game where you leap and slide through a dystopian cityscape, evading authorities and overcoming obstacles. With its sleek visuals and fast-paced gameplay, it's a thrilling test of reflexes and agility that will keep you on the edge of your seat."
    },
    {
        "name": "Draw Bridge Puzzle Game 3D",
        "url": "https://cupidmobi.com/draw-bridge-puzzle-game-3d-app",
        "img": "Draw_Bridge_Puzzle_Game_3D.jpg",
        "description": "Draw Bridge Puzzle Game 3D is a challenging puzzle game where you draw lines to construct bridges and overcome obstacles. With realistic physics and immersive 3D graphics, it offers a unique and engaging gaming experience for puzzle enthusiasts."
    },
    {
        "name": "Bad Spider Thief",
        "url": "https://cupidmobi.com/bad-spider-thief-app",
        "img": "Bad_Spider_Thief.jpg",
        "description": "Bad Spider Thief is an action-packed platformer where you play as a mischievous spider on a quest to steal precious gems. Swing, climb, and sneak your way through treacherous levels filled with traps and enemies in this thrilling adventure."
    },
    {
        "name": "Money Print Fever",
        "url": "https://cupidmobi.com/money-print-fever-app",
        "img": "Money_Print_Fever.jpg",
        "description": "Money Print Fever is a fast-paced arcade game where you print money to become the wealthiest tycoon in town. Manage your printing press, avoid obstacles, and collect coins as you race against the clock in this addictive money-making adventure."
    },
    {
        "name": "Super Cowboy Run",
        "url": "https://cupidmobi.com/super-cowboy-run-game",
        "img": "Super_Cowboy_Run.jpg",
        "description": "Super Cowboy Run is an action-packed endless runner game where you dash through the Wild West, dodging obstacles and collecting coins. With its charming pixel art style and addictive gameplay, it's a wild ride that will keep you coming back for more."
    },
    {
        "name": "Super Color Lines",
        "url": "https://cupidmobi.com/super-color-lines-game",
        "img": "Super_Color_Lines.jpg",
        "description": "Super Color Lines is a colorful puzzle game where you match colored balls to clear the board and earn points. With its simple yet addictive gameplay and vibrant graphics, it's a perfect way to pass the time and challenge your puzzle-solving skills."
    },
    {
        "name": "Are you of the 1.7 million who downloaded Quibi",
        "url": "https://cupidmobi.com/are-you-of-the-17-million-who-downloaded-quibi-video",
        "img": "Are_you_of_the_1.7_million_who_downloaded_Quibi.jpg",
        "description": "Join the millions of users who have embraced Quibi, the revolutionary new streaming platform that offers bite-sized content designed for mobile viewing. With its diverse range of original shows and movies, Quibi promises entertainment on the go, anytime, anywhere."
    },
    {
        "name": "Cleaning up beaches and creating art, one butt at a time",
        "url": "https://cupidmobi.com/cleaning-up-beaches-and-creating-art-one-butt-at-a-time-video",
        "img": "Cleaning_up_beaches_and_creating_art,_one_butt_at_a_time.jpg",
        "description": "Join the movement to clean up beaches and create art from discarded cigarette butts, turning environmental waste into beautiful works of art. With creativity and activism, volunteers are raising awareness about the harmful impact of littering and inspiring positive change in their communities."
    },
    {
        "name": "Beat the heat with blue lagoon cocktail popsicles",
        "url": "https://cupidmobi.com/beat-the-heat-with-blue-lagoon-cocktail-popsicles-video",
        "img": "Beat_the_heat_with_blue_lagoon_cocktail_popsicles.jpg",
        "description": "Beat the summer heat with these refreshing blue lagoon cocktail popsicles. Made with a blend of blue curaçao, vodka, and lemonade, they're a cool and colorful twist on the classic cocktail that's sure to delight your taste buds."
    },
    {
        "name": "Spiderman",
        "url": "https://cupidmobi.com/spiderman-game",
        "img": "Spiderman.jpg",
        "description": "Spiderman is an action-packed superhero game where you swing through the city, battling villains and saving innocent civilians. With its thrilling missions and iconic web-slinging gameplay, it's a must-play for fans of the friendly neighborhood Spider-Man."
    },
    {
        "name": "Sights with Heights The narrow bridges of Caminito del Rey",
        "url": "https://cupidmobi.com/sights-with-heights-the-narrow-bridges-of-caminito-del-rey-video",
        "img": "Sights_with_Heights_The_narrow_bridges_of_Caminito_del_Rey.jpg",
        "description": "Challenge your sense of adventure with a thrilling hike along the narrow bridges of Caminito del Rey, a breathtaking trail carved into the steep cliffs of southern Spain. As you traverse the dizzying heights and marvel at the stunning views below, you'll feel a rush of adrenaline like never before."
    },
    {
        "name": "Bottle Knock Down",
        "url": "https://cupidmobi.com/bottle-knock-down-game",
        "img": "Bottle_Knock_Down.jpg",
        "description": "Bottle Knock Down is a fun and addictive carnival game where you use a slingshot to knock down bottles and earn prizes. With its intuitive controls and realistic physics, it's a satisfying experience that's perfect for testing your aim and accuracy."
    },
    {
        "name": "Finding Meng",
        "url": "https://cupidmobi.com/finding-meng-app",
        "img": "Finding_Meng.jpg",
        "description": "Finding Meng is a captivating puzzle game that challenges you to navigate through intricate mazes in search of the lost treasure. With clever puzzles and engaging gameplay, it's a test of wit and strategy that will keep you entertained for hours."
    },
    {
        "name": "Hide And Seek Wednesday",
        "url": "https://cupidmobi.com/hide-and-seek-wednesday-app",
        "img": "Hide_And_Seek_Wednesday.jpg",
        "description": "Hide And Seek Wednesday is a charming hidden object game set in a whimsical world of colorful characters and playful puzzles. Search for hidden items, solve clues, and uncover secrets as you embark on a delightful adventure through the land of Wednesday."
    },
    {
        "name": "JF-17 Thunder Airstrike",
        "url": "https://cupidmobi.com/jf-17-thunder-airstrike-app",
        "img": "JF-17_Thunder_Airstrike.jpg",
        "description": "JF-17 Thunder Airstrike puts you in the cockpit of a cutting-edge fighter jet as you engage in high-stakes aerial combat. Dogfight enemy planes, dodge missiles, and unleash devastating airstrikes in this adrenaline-pumping flight simulation game."
    },
    {
        "name": "Physics Line",
        "url": "https://cupidmobi.com/physics-line-game",
        "img": "Physics_Line.jpg",
        "description": "Physics Line is a captivating puzzle game where you draw lines to guide a ball to its destination while overcoming obstacles and challenges. With its realistic physics and challenging levels, it offers a rewarding and engaging gameplay experience for puzzle enthusiasts."
    },
    {
        "name": "JETZ",
        "url": "https://cupidmobi.com/jetz-app",
        "img": "JETZ.jpg",
        "description": "JETZ is a fast-paced arcade game where you pilot a futuristic jet through treacherous obstacles and enemy defenses. With its sleek graphics and addictive gameplay, it's a thrilling test of reflexes and skill that will keep you coming back for more."
    },
    {
        "name": "Tough Muscle Man",
        "url": "https://cupidmobi.com/tough-muscle-man-game",
        "img": "Tough_Muscle_Man.jpg",
        "description": "Tough Muscle Man is an action-packed beat 'em up game where you play as a burly hero fighting against hordes of enemies. With its retro-inspired graphics and intense combat, it delivers an adrenaline-fueled gaming experience reminiscent of classic arcade brawlers."
    },
    {
        "name": "Pervert with Handy Cam Part 1",
        "url": "https://cupidmobi.com/pervert-with-handy-cam-part-1-video",
        "img": "Pervert_with_Handy_Cam_Part_1.jpg",
        "description": "Delve into the disturbing world of a pervert with a handy cam as he prowls the streets in search of unsuspecting victims. With voyeuristic intent, he captures intimate moments and violates privacy, leaving a trail of fear and trauma in his wake."
    },
    {
        "name": "Medellín is the backpacking spot you've been looking for",
        "url": "https://cupidmobi.com/medelln-is-the-backpacking-spot-youve-been-looking-for-video",
        "img": "Failed to download image",
        "description": "Experience the vibrant culture and rich history of Medellín, Colombia's bustling metropolis and backpacking hotspot. From its lively street art and salsa dancing to its scenic parks and lively markets, Medellín offers a wealth of attractions for travelers seeking adventure and excitement."
    },
    {
        "name": "Knock Down",
        "url": "https://cupidmobi.com/knock-down-game",
        "img": "Knock_Down.jpg",
        "description": "Knock Down is a fun and addictive arcade game where you use a slingshot to knock down structures and targets. With its intuitive controls and realistic physics, it's a satisfying experience that's perfect for relieving stress and unleashing your inner demolition expert."
    },
    {
        "name": "Rescue Cut",
        "url": "https://cupidmobi.com/rescue-cut-game",
        "img": "Rescue_Cut.jpg",
        "description": "Rescue Cut is a thrilling puzzle game where you use strategic cuts to rescue characters trapped in various predicaments. With its clever mechanics and challenging levels, it offers a unique and engaging gameplay experience that will test your problem-solving skills."
    },
    {
        "name": "The pilots flying a restored WWII plane around the world",
        "url": "https://cupidmobi.com/the-pilots-flying-a-restored-wwii-plane-around-the-world-video",
        "img": "The_pilots_flying_a_restored_WWII_plane_around_the_world.jpg",
        "description": "Join the brave pilots as they embark on an epic journey to fly a restored WWII plane around the world, retracing the historic flight routes of the past and honoring the heroes who served during World War II. From remote airstrips to bustling cities, they'll crisscross the globe in pursuit of adventure and remembrance."
    },
    {
        "name": "How to Photo Transfer Anything Images on rocks made easy",
        "url": "https://cupidmobi.com/how-to-photo-transfer-anything-images-on-rocks-made-easy-video",
        "img": "How_to_Photo_Transfer_Anything_Images_on_rocks_made_easy.jpg",
        "description": "Discover the art of photo transfer onto rocks with this easy-to-follow tutorial. With a few simple materials and techniques, you can create stunning personalized keepsakes and decorative accents that showcase your favorite photos in a unique and creative way."
    },
    {
        "name": "Helicopter Fighter",
        "url": "https://cupidmobi.com/helicopter-fighter-app",
        "img": "Helicopter_Fighter.jpg",
        "description": "Helicopter Fighter puts you in the cockpit of a powerful combat helicopter, ready to take on enemy forces in adrenaline-pumping aerial battles. With intuitive controls and intense action, it offers an immersive gaming experience for fans of air combat games."
    },
    {
        "name": "Sights with Heights The cliff side sanctuary between heaven and earth",
        "url": "https://cupidmobi.com/sights-with-heights-the-cliff-side-sanctuary-between-heaven-and-earth-video",
        "img": "Sights_with_Heights_The_cliff_side_sanctuary_between_heaven_and_earth.jpg",
        "description": "Journey to the edge of the world and discover the awe-inspiring beauty of a cliff-side sanctuary perched high above the clouds. As you stand on the precipice and gaze out at the breathtaking landscape below, you'll feel a profound sense of peace and connection to the natural world."
    },
    {
        "name": "Bleeding Nose",
        "url": "https://cupidmobi.com/bleeding-nose-video",
        "img": "Bleeding_Nose.jpg",
        "description": "Learn how to properly care for a bleeding nose with these simple steps and remedies. From applying pressure to the nostrils to using cold compresses and nasal sprays, these first aid techniques can help stop the bleeding and prevent further discomfort or complications."
    },
    {
        "name": "Slendrina must die the house",
        "url": "https://cupidmobi.com/slendrina-must-die-the-house-game",
        "img": "Slendrina_must_die_the_house.jpg",
        "description": "Slendrina Must Die: The House is a spine-chilling horror game where you explore a haunted house and confront the malevolent entity known as Slendrina. With its eerie atmosphere and intense scares, it's a terrifying experience that will keep you on the edge of your seat."
    },
    {
        "name": "Card-Jitsu",
        "url": "https://cupidmobi.com/card-jitsu-app",
        "img": "Card-Jitsu.jpg",
        "description": "Card-Jitsu is an exciting card game set in the snowy mountains of Club Penguin. Master the elements of fire, water, and snow as you battle opponents in strategic card duels, earning belts and climbing the ranks to become a Card-Jitsu master."
    },
    {
        "name": "Man in Garbage Can Part 1",
        "url": "https://cupidmobi.com/man-in-garbage-can-part-1-video",
        "img": "Man_in_Garbage_Can_Part_1.jpg",
        "description": "In this captivating documentary series, follow the journey of a man living in a garbage can as he navigates the challenges of life on the streets. With resilience and resourcefulness, he finds hope and humanity amidst the chaos and adversity of his surroundings."
    },
    {
        "name": "Mazes",
        "url": "https://cupidmobi.com/mazes-game",
        "img": "Mazes.jpg",
        "description": "Mazes is a classic puzzle game where you navigate through intricate labyrinths to reach the exit. With its diverse maze designs and varying levels of difficulty, it offers a challenging and engaging experience for maze enthusiasts of all skill levels."
    },
    {
        "name": "Fruit Snake",
        "url": "https://cupidmobi.com/fruit-snake-game",
        "img": "Fruit_Snake.jpg",
        "description": "Fruit Snake is a classic arcade game where you control a hungry snake as it slithers around the screen gobbling up fruit. With its simple yet addictive gameplay and colorful graphics, it's a timeless pastime that's perfect for players of all ages."
    },
    {
        "name": "Slenderclown-Be Afraid of it",
        "url": "https://cupidmobi.com/slenderclown-be-afraid-of-it-game",
        "img": "Slenderclown-Be_Afraid_of_it.jpg",
        "description": "Slenderclown: Be Afraid of It is a horrifying horror game where you must survive the night in a dark carnival infested with the sinister Slenderclown. With its creepy atmosphere and relentless pursuit, it's a nerve-wracking experience that will leave you trembling with fear."
    },
    {
        "name": "Pic Shop",
        "url": "https://cupidmobi.com/pic-shop-app",
        "img": "Pic_Shop.jpg",
        "description": "Pic Shop is a comprehensive photo editing tool that offers a wide range of features to enhance your images. From basic adjustments like brightness and contrast to advanced filters and effects, it provides everything you need to unleash your creativity and elevate your photos."
    },
    {
        "name": "Turning leftover bread into panzanella & bruschetta caprese",
        "url": "https://cupidmobi.com/turning-leftover-bread-into-panzanella--bruschetta-caprese-video",
        "img": "Turning_leftover_bread_into_panzanella_&_bruschetta_caprese.jpg",
        "description": "Reduce food waste and indulge your taste buds with these delicious recipes for panzanella and bruschetta caprese, made with leftover bread and fresh, seasonal ingredients. From juicy tomatoes and fragrant basil to crusty bread and tangy balsamic vinegar, these dishes are a celebration of Italian flavors and ingenuity."
    },
    {
        "name": "Inspire in a minute The supermodel discovered at 60",
        "url": "https://cupidmobi.com/inspire-in-a-minute-the-supermodel-discovered-at-60-video",
        "img": "Inspire_in_a_minute_The_supermodel_discovered_at_60.jpg",
        "description": "Meet the supermodel who defied ageism and broke barriers by launching her modeling career at the age of 60. With her striking looks and confident presence, she's proving that beauty knows no age limit and inspiring women of all ages to pursue their passions and embrace their inner strength."
    },
    {
        "name": "Reckless Blind Man Part 1",
        "url": "https://cupidmobi.com/reckless-blind-man-part-1-video",
        "img": "Reckless_Blind_Man_Part_1.jpg",
        "description": "Witness the reckless behavior of a blind man as he navigates the dangers of the urban jungle without fear or caution. With a fearless spirit and unwavering confidence, he defies societal norms and challenges perceptions of disability, inspiring others to embrace life with courage and determination."
    },
    {
        "name": "Guess Celeb Names",
        "url": "https://cupidmobi.com/guess-celeb-names-app",
        "img": "Guess_Celeb_Names.jpg",
        "description": "Guess Celeb Names is an entertaining trivia game where you test your knowledge of celebrities by guessing their names from images. With a wide variety of famous faces to identify, it's a fun challenge for pop culture enthusiasts of all ages."
    },
    {
        "name": "Dark Rooms",
        "url": "https://cupidmobi.com/dark-rooms-game",
        "img": "Dark_Rooms.jpg",
        "description": "Dark Rooms is a spooky escape room game where you must solve puzzles and unravel mysteries to escape from haunted rooms. With its eerie atmosphere and challenging puzzles, it offers a thrilling and immersive experience for fans of horror and adventure games."
    },
    {
        "name": "My Super Happy Glass 3D",
        "url": "https://cupidmobi.com/my-super-happy-glass-3d-game",
        "img": "My_Super_Happy_Glass_3D.jpg",
        "description": "My Super Happy Glass 3D is a delightful physics-based puzzle game where you fill up a glass with colorful liquid by drawing lines. With its charming visuals and challenging levels, it's a fun and addictive game that will brighten up your day."
    },
    {
        "name": "Balancer Ball 3D",
        "url": "https://cupidmobi.com/balancer-ball-3d-game",
        "img": "Balancer_Ball_3D.jpg",
        "description": "Balancer Ball 3D is a challenging balance game where you tilt your device to guide a ball through increasingly difficult obstacle courses. With its realistic physics and precise controls, it offers a thrilling test of skill and coordination that will keep you on the edge of your seat."
    },
    {
        "name": "Genius Game",
        "url": "https://cupidmobi.com/genius-game-game",
        "img": "Genius_Game.jpg",
        "description": "Genius Game is a brain-teasing puzzle game where you test your IQ with a series of challenging riddles and logic puzzles. With its clever twists and mind-bending challenges, it's a fun and stimulating way to exercise your brain and expand your mental horizons."
    },
    {
        "name": "Fairy Tale Dream Spots The sinking castle of Scaligera",
        "url": "https://cupidmobi.com/fairy-tale-dream-spots-the-sinking-castle-of-scaligera-video",
        "img": "Failed to download image",
        "description": "Discover the haunting beauty of the sinking castle of Scaligera, a medieval fortress perched on the shores of Lake Garda in Italy. As you explore the crumbling ruins and listen to the whispers of the past, you'll be transported to a bygone era of knights, kings, and intrigue."
    },
    {
        "name": "Facial Twin Editor",
        "url": "https://cupidmobi.com/facial-twin-editor-app",
        "img": "Facial_Twin_Editor.jpg",
        "description": "Facial Twin Editor is a fun and entertaining application that lets you create amusing images by morphing faces together. Whether you want to see what you'd look like with your favorite celebrity's features or simply enjoy playful photo editing, this app offers endless possibilities."
    },
    {
        "name": "Rude Man on Beach Part 1",
        "url": "https://cupidmobi.com/rude-man-on-beach-part-1-video",
        "img": "Rude_Man_on_Beach_Part_1.jpg",
        "description": "Encounter the rude behavior of a man on the beach as he disregards social norms and exhibits disrespectful conduct towards others. With arrogance and entitlement, he disrupts the peace and tranquility of the seaside environment, leaving a negative impact on those around him."
    },
    {
        "name": "Punch Knockout Mayhem",
        "url": "https://cupidmobi.com/punch-knockout-mayhem-game",
        "img": "Punch_Knockout_Mayhem.jpg",
        "description": "Punch Knockout Mayhem is a fast-paced boxing game where you step into the ring and duke it out against formidable opponents. With its responsive controls and intense bouts, it's a knockout experience that will test your boxing skills and reflexes."
    },
    {
        "name": "Pizza Maker Cooking Game",
        "url": "https://cupidmobi.com/pizza-maker-cooking-game-app",
        "img": "Pizza_Maker_Cooking_Game.jpg",
        "description": "Pizza Maker Cooking Game lets you become a master chef as you create delicious pizzas from scratch. From choosing the toppings to baking the perfect crust, it's a fun and interactive cooking experience that's sure to satisfy your cravings."
    },
    {
        "name": "Kylie Jenner recreates iconic Naomi Campbell bikini moment",
        "url": "https://cupidmobi.com/kylie-jenner-recreates-iconic-naomi-campbell-bikini-moment-video",
        "img": "Kylie_Jenner_recreates_iconic_Naomi_Campbell_bikini_moment.jpg",
        "description": "Kylie Jenner pays homage to supermodel Naomi Campbell by recreating one of her iconic bikini moments. With her striking resemblance and confident pose, Jenner captures the essence of Campbell's timeless beauty and influence on fashion and pop culture."
    },
    {
        "name": "Unicorn Dash",
        "url": "https://cupidmobi.com/unicorn-dash-game",
        "img": "Unicorn_Dash.jpg",
        "description": "Unicorn Dash is a magical endless runner game where you guide a majestic unicorn through enchanted forests and mystical landscapes. With its colorful visuals and exhilarating gameplay, it's a whimsical adventure that will capture the hearts of players of all ages."
    },
    {
        "name": "Doodle Tanks",
        "url": "https://cupidmobi.com/doodle-tanks-app",
        "img": "Doodle_Tanks.jpg",
        "description": "Doodle Tanks is a unique blend of strategy and creativity, where you design and deploy your own customized tanks to conquer enemy territory. With its charming doodle-style graphics and strategic gameplay, it offers a fresh take on the classic tank warfare genre."
    },
    {
        "name": "Wrecked",
        "url": "https://cupidmobi.com/wrecked-game",
        "img": "Wrecked.jpg",
        "description": "Wrecked is an action-packed racing game where you compete in high-speed demolition derbies against other drivers. With its realistic physics and intense collisions, it's a crash-tastic experience that's perfect for adrenaline junkies and thrill-seekers."
    },
    {
        "name": "Neon Hockey",
        "url": "https://cupidmobi.com/neon-hockey-game",
        "img": "Neon_Hockey.jpg",
        "description": "Neon Hockey is a futuristic sports game where you compete in fast-paced air hockey matches against AI opponents or friends. With its neon visuals and responsive controls, it delivers an electrifying gaming experience that will keep you coming back for more."
    },
    {
        "name": "Pixel Art",
        "url": "https://cupidmobi.com/pixel-art-game",
        "img": "Pixel_Art.jpg",
        "description": "Pixel Art is a relaxing coloring game where you create beautiful artworks by filling in pixelated designs with vibrant colors. With its vast collection of templates and intuitive controls, it's a creative outlet that's perfect for artists of all ages and skill levels."
    },
    {
        "name": "How to photo transfer anything A wooden gift for mom",
        "url": "https://cupidmobi.com/how-to-photo-transfer-anything-a-wooden-gift-for-mom-video",
        "img": "How_to_photo_transfer_anything_A_wooden_gift_for_mom.jpg",
        "description": "Learn how to create a personalized wooden gift for mom using the photo transfer technique. With simple supplies and step-by-step instructions, you can transform a plain wooden surface into a heartfelt keepsake that captures cherished memories and celebrates the special bond between mother and child."
    },
    {
        "name": "Puzzle Bunch",
        "url": "https://cupidmobi.com/puzzle-bunch-game",
        "img": "Puzzle_Bunch.jpg",
        "description": "Puzzle Bunch is a collection of addictive puzzle games designed to keep you entertained for hours. From classic Sudoku to challenging logic puzzles, it offers a variety of brain-teasing challenges that will put your mental skills to the test."
    },
    {
        "name": "Crazy Cravings 'When I'm behind my mask, I'm basically someone new'",
        "url": "https://cupidmobi.com/crazy-cravings-when-im-behind-my-mask-im-basically-someone-new-video",
        "img": "Crazy_Cravings_'When_I'm_behind_my_mask,_I'm_basically_someone_new'.jpg",
        "description": "A food blogger reveals the transformative power of cosplay, allowing her to embody different personas and explore new culinary experiences with confidence. From quirky characters to iconic figures, she channels her cravings into creative costume designs that blur the lines between fantasy and reality."
    },
    {
        "name": "Box Race",
        "url": "https://cupidmobi.com/box-race-game",
        "img": "Box_Race.jpg",
        "description": "Box Race is a fast-paced racing game where you navigate your way through challenging tracks in a variety of cardboard boxes. With quirky visuals, responsive controls, and exciting gameplay, it offers a unique and entertaining racing experience for players of all ages."
    },
    {
        "name": "Vegan Ice Cream Fresh Fruit Popsicles",
        "url": "https://cupidmobi.com/vegan-ice-cream-fresh-fruit-popsicles-video",
        "img": "Vegan_Ice_Cream_Fresh_Fruit_Popsicles.jpg",
        "description": "Indulge in the vibrant flavors of summer with these refreshing vegan ice cream fresh fruit popsicles. Made with a medley of ripe, seasonal fruits and creamy coconut milk, they're a guilt-free treat that's bursting with natural sweetness and flavor."
    },
    {
        "name": "Princess DressUp And Makeover",
        "url": "https://cupidmobi.com/princess-dressup-and-makeover-app",
        "img": "Princess_DressUp_And_Makeover.jpg",
        "description": "Princess DressUp And Makeover lets you unleash your inner fashionista as you style and accessorize virtual princesses. With a vast wardrobe of glamorous dresses and sparkling accessories, it's a magical makeover experience fit for royalty."
    },
    {
        "name": "Photo Text Editor",
        "url": "https://cupidmobi.com/photo-text-editor-app",
        "img": "Photo_Text_Editor.jpg",
        "description": "Photo Text Editor is a handy app that allows you to add text and captions to your photos with ease. Whether you want to create memes, add quotes, or personalize your images with messages, this app provides a simple yet effective solution."
    },
    {
        "name": "Inspire in a Minute Tim brought sexy back for the Lumberjack",
        "url": "https://cupidmobi.com/inspire-in-a-minute-tim-brought-sexy-back-for-the-lumberjack-video",
        "img": "Inspire_in_a_Minute_Tim_brought_sexy_back_for_the_Lumberjack.jpg",
        "description": "Discover the inspiring journey of Tim, the lumberjack who embraced his unique style and brought sexy back to the forest with his rugged charm and confidence. From his flannel shirts and work boots to his rugged beard and piercing gaze, Tim is redefining masculinity and inspiring others to embrace their individuality."
    },
    {
        "name": "Doodle God 8-bit Mania",
        "url": "https://cupidmobi.com/doodle-god-8-bit-mania-app",
        "img": "Doodle_God_8-bit_Mania.jpg",
        "description": "Doodle God 8-bit Mania takes the classic puzzle game to the retro realm, challenging you to create the universe pixel by pixel. With its nostalgic 8-bit graphics and addictive gameplay, it's a delightful journey through the world of elemental alchemy."
    },
    {
        "name": "Square Adventure",
        "url": "https://cupidmobi.com/square-adventure-game",
        "img": "Square_Adventure.jpg",
        "description": "Square Adventure is a retro-inspired platformer game where you navigate a square through a series of challenging levels filled with enemies and hazards. With its classic pixel art style and addictive gameplay, it's a nostalgic journey that will keep you entertained for hours."
    },
    {
        "name": "Baby Carier on Car",
        "url": "https://cupidmobi.com/baby-carier-on-car-video",
        "img": "Baby_Carier_on_Car.jpg",
        "description": "Ensure your baby's safety and comfort while traveling with this innovative baby carrier designed for use in the car. With its secure harness and plush padding, it provides optimal protection and support for your little one during car rides, allowing you to travel with peace of mind."
    },
    {
        "name": "Odd Things",
        "url": "https://cupidmobi.com/odd-things-app",
        "img": "Odd_Things.jpg",
        "description": "Odd Things is a quirky and offbeat puzzle game that challenges you to solve surreal riddles and uncover hidden secrets. With its eccentric characters and mind-bending puzzles, it offers a uniquely charming gaming experience that's sure to leave you scratching your head."
    },
    {
        "name": "Santa Claus The Pervert Part 1",
        "url": "https://cupidmobi.com/santa-claus-the-pervert-part-1-video",
        "img": "Santa_Claus_The_Pervert_Part_1.jpg",
        "description": "Uncover the dark truth behind the cheerful facade of Santa Claus as he reveals himself to be a perverted predator preying on innocent children. With deceit and manipulation, he exploits the magic of Christmas for his own twisted desires, leaving a trail of trauma and devastation in his wake."
    },
    {
        "name": "Doodle Kingdom",
        "url": "https://cupidmobi.com/doodle-kingdom-app",
        "img": "Doodle_Kingdom.jpg",
        "description": "Doodle Kingdom invites you to embark on a whimsical adventure through a magical realm filled with knights, wizards, and mythical creatures. Build your kingdom, conquer enemies, and fulfill quests as you become the ruler of your own doodle-inspired fantasy world."
    },
    {
        "name": "Fairy tale dream spots The prettiest village in Andalucía",
        "url": "https://cupidmobi.com/fairy-tale-dream-spots-the-prettiest-village-in-andaluca-video",
        "img": "Fairy_tale_dream_spots_The_prettiest_village_in_Andalucía.jpg",
        "description": "Explore the enchanting beauty of Andalucía's prettiest village, with its whitewashed houses, winding streets, and stunning views of the Mediterranean Sea. As you wander through the cobblestone alleys and soak in the sun-drenched scenery, you'll feel like you've stepped into a real-life fairy tale."
    },
    {
        "name": "One Touch Draw",
        "url": "https://cupidmobi.com/one-touch-draw-game",
        "img": "One_Touch_Draw.jpg",
        "description": "One Touch Draw is a minimalist puzzle game where you draw lines to connect dots without crossing paths. With its clean interface and intuitive gameplay, it's a relaxing and addictive way to unwind and exercise your brain."
    },
    {
        "name": "Pastel Doll",
        "url": "https://cupidmobi.com/pastel-doll-game",
        "img": "Pastel_Doll.jpg",
        "description": "Pastel Doll is a charming dress-up game where you create stylish outfits for adorable dolls using a variety of pastel-colored clothing and accessories. With its cute graphics and endless customization options, it's a delightful game that will spark your creativity and imagination."
    },
    {
        "name": "Brain For Monster Truck",
        "url": "https://cupidmobi.com/brain-for-monster-truck-game",
        "img": "Brain_For_Monster_Truck.jpg",
        "description": "Brain For Monster Truck is a challenging puzzle game where you manipulate objects and obstacles to guide a monster truck to the finish line. With its physics-based puzzles and creative solutions, it offers a unique and engaging gameplay experience for puzzle enthusiasts."
    },
    {
        "name": "Love Photo",
        "url": "https://cupidmobi.com/love-photo-app",
        "img": "Love_Photo.jpg",
        "description": "Love Photo is a delightful photo editing app tailored for expressing love and affection through pictures. With its charming collection of filters, stickers, and effects, it allows you to craft heartwarming and romantic images to share with your loved ones."
    },
    {
        "name": "Stick Panda",
        "url": "https://cupidmobi.com/stick-panda-game",
        "img": "Stick_Panda.jpg",
        "description": "Stick Panda is a charming puzzle platformer game where you guide a cute panda through a series of challenging levels filled with traps and obstacles. With its adorable graphics and intuitive controls, it's a delightful adventure that's perfect for players of all ages."
    },
    {
        "name": "Color Bird Sort Puzzle Game 3D",
        "url": "https://cupidmobi.com/color-bird-sort-puzzle-game-3d-app",
        "img": "Color_Bird_Sort_Puzzle_Game_3D.jpg",
        "description": "Color Bird Sort Puzzle Game 3D is a delightful puzzle game where you sort colorful birds into their corresponding nests. With its charming 3D graphics and intuitive gameplay, it's a fun and relaxing way to exercise your brain and unwind."
    },
    {
        "name": "Cube Rider",
        "url": "https://cupidmobi.com/cube-rider-app",
        "img": "Cube_Rider.jpg",
        "description": "Cube Rider is an exhilarating arcade game where you navigate a futuristic cube through a maze of obstacles and traps. With its minimalist graphics and addictive gameplay, it's a thrilling test of reflexes and spatial awareness that will keep you coming back for more."
    },
    {
        "name": "Roller Blader Part 1",
        "url": "https://cupidmobi.com/roller-blader-part-1-video",
        "img": "Roller_Blader_Part_1.jpg",
        "description": "Experience the exhilarating thrills of rollerblading as a daring skater takes to the streets with speed and style. With gravity-defying tricks and smooth moves, he defies limits and pushes boundaries, leaving onlookers in awe of his skill and athleticism."
    },
    {
        "name": "Care Fort",
        "url": "https://cupidmobi.com/care-fort-app",
        "img": "Care_Fort.jpg",
        "description": "Care Fort is a charming simulation game where you build and manage your own animal sanctuary. From feeding and caring for adorable animals to expanding and decorating your sanctuary, it's your chance to create a safe and happy home for all creatures great and small."
    },
    {
        "name": "My Cool School Camilla's studying the trapeze",
        "url": "https://cupidmobi.com/my-cool-school-camillas-studying-the-trapeze-video",
        "img": "My_Cool_School_Camilla's_studying_the_trapeze.jpg",
        "description": "Follow Camilla's journey as she masters the art of the trapeze at her cool school, where students learn circus skills and perform gravity-defying stunts high above the ground. With dedication and determination, Camilla is defying expectations and soaring to new heights in pursuit of her passion for aerial acrobatics."
    },
    {
        "name": "Alchemy Jam",
        "url": "https://cupidmobi.com/alchemy-jam-app",
        "img": "Alchemy_Jam.jpg",
        "description": "Alchemy Jam is a delightful puzzle game where you combine elements to create new items and discover hidden recipes. With its charming visuals and clever mechanics, it offers a fun and engaging experience for fans of alchemy and puzzle games."
    },
    {
        "name": "Vegan Ice Cream Pineapple Mint Lime",
        "url": "https://cupidmobi.com/vegan-ice-cream-pineapple-mint-lime-video",
        "img": "Vegan_Ice_Cream_Pineapple_Mint_Lime.jpg",
        "description": "Transport your taste buds to the tropics with these zesty pineapple mint lime vegan ice cream popsicles. Made with tangy pineapple, refreshing mint, and zesty lime, they're a refreshing and flavorful treat that's perfect for cooling off on a hot summer day."
    },
    {
        "name": "Five Fun facts about Mean Girls Broadway star Sabrina Carpenter",
        "url": "https://cupidmobi.com/five-fun-facts-about-mean-girls-broadway-star-sabrina-carpenter-video",
        "img": "Five_Fun_facts_about_Mean_Girls_Broadway_star_Sabrina_Carpenter.jpg",
        "description": "Discover five fun facts about Sabrina Carpenter, the talented actress and singer who's making a splash on Broadway in the hit musical Mean Girls. From her early career beginnings to her favorite backstage rituals, these trivia tidbits offer insight into the life and personality of this rising star."
    },
    {
        "name": "Sahara Motocross",
        "url": "https://cupidmobi.com/sahara-motocross-app",
        "img": "Sahara_Motocross.jpg",
        "description": "Sahara Motocross is an exhilarating racing game set in the unforgiving deserts of the Sahara. Strap on your helmet, rev up your engine, and navigate treacherous terrain as you compete against other riders in a quest for victory."
    },
    {
        "name": "Hotel Design And Decoration",
        "url": "https://cupidmobi.com/hotel-design-and-decoration-app",
        "img": "Hotel_Design_And_Decoration.jpg",
        "description": "Hotel Design And Decoration lets you unleash your creativity as you design and decorate your own luxury hotel. From elegant furnishings to stunning decor, it's your chance to create the ultimate five-star destination in this immersive interior design game."
    },
    {
        "name": "Cell Machine",
        "url": "https://cupidmobi.com/cell-machine-app",
        "img": "Cell_Machine.jpg",
        "description": "Cell Machine is a fascinating puzzle game where you manipulate cells to create intricate patterns and structures. With its intuitive controls and endless possibilities, it's a creative sandbox where you can explore the beauty of cellular automata."
    },
    {
        "name": "Word Game",
        "url": "https://cupidmobi.com/word-game-game",
        "img": "Word_Game.jpg",
        "description": "Word Game is a challenging puzzle game where you test your vocabulary and spelling skills by forming words from a set of scrambled letters. With hundreds of levels and varying difficulty, it's a fun and educational way to expand your language abilities."
    },
    {
        "name": "Rise Up",
        "url": "https://cupidmobi.com/rise-up-game",
        "img": "Rise_Up.jpg",
        "description": "Rise Up is a captivating puzzle game where you guide a balloon through a series of obstacles, protecting it from dangers along the way. With its simple yet addictive gameplay and charming graphics, it's a test of skill and strategy that will keep you engaged for hours."
    },
    {
        "name": "Horse Quiz",
        "url": "https://cupidmobi.com/horse-quiz-game",
        "img": "Horse_Quiz.jpg",
        "description": "Horse Quiz is an educational trivia game where you test your knowledge of horses and equestrian sports. With a variety of questions and informative content, it's a fun and engaging way to learn more about these magnificent creatures and the world of horse riding."
    },
    {
        "name": "Beat the heat with cuervo sangria popsicles",
        "url": "https://cupidmobi.com/beat-the-heat-with-cuervo-sangria-popsicles-video",
        "img": "Beat_the_heat_with_cuervo_sangria_popsicles.jpg",
        "description": "Cool off with these delicious cuervo sangria popsicles, infused with the rich flavors of red wine, citrus fruits, and tequila. Whether you're lounging by the pool or hosting a backyard barbecue, these boozy treats are sure to be a hit with friends and family."
    },
    {
        "name": "Retro Cam Pro",
        "url": "https://cupidmobi.com/retro-cam-pro-app",
        "img": "Retro_Cam_Pro.jpg",
        "description": "Retro Cam Pro transports you back in time with its vintage-inspired filters and effects. Rediscover the charm of analog photography as you transform your modern-day photos into nostalgic masterpieces reminiscent of old-school film cameras."
    },
    {
        "name": "Office Horror Story",
        "url": "https://cupidmobi.com/office-horror-story-game",
        "img": "Office_Horror_Story.jpg",
        "description": "Office Horror Story is a spine-chilling horror game where you explore a haunted office building and uncover its dark secrets. With its immersive atmosphere and terrifying encounters, it's a heart-pounding experience that will leave you trembling with fear."
    },
    {
        "name": "Young CEO 'When I look at a camera, I see power in me & I see greatness'",
        "url": "https://cupidmobi.com/young-ceo-when-i-look-at-a-camera-i-see-power-in-me--i-see-greatness-video",
        "img": "Young_CEO_'When_I_look_at_a_camera,_I_see_power_in_me_&_I_see_greatness'.jpg",
        "description": "Meet the young CEO who's leading by example and inspiring others to believe in themselves and pursue their dreams. With confidence and determination, he's building a successful business empire while empowering the next generation of leaders to embrace their potential and seize opportunities for greatness."
    },
    {
        "name": "Amazing Waterfalls Zambia's jaw-dropping natural wonder",
        "url": "https://cupidmobi.com/amazing-waterfalls-zambias-jaw-dropping-natural-wonder-video",
        "img": "Amazing_Waterfalls_Zambia's_jaw-dropping_natural_wonder.jpg",
        "description": "Embark on an unforgettable adventure to Zambia's jaw-dropping waterfalls, where the mighty Zambezi River plunges over a precipice to create one of the world's most spectacular natural wonders. As you stand in awe of the thundering cascades and misty spray, you'll be mesmerized by the raw power and beauty of nature."
    },
    {
        "name": "Road Racer",
        "url": "https://cupidmobi.com/road-racer-game",
        "img": "Road_Racer.jpg",
        "description": "Road Racer is an adrenaline-fueled racing game where you compete against other drivers in high-speed races across scenic landscapes. With stunning graphics, realistic physics, and intense competition, it delivers an immersive racing experience for fans of fast cars and thrilling speeds."
    },
    {
        "name": "Doll Dream House Adventure Fun",
        "url": "https://cupidmobi.com/doll-dream-house-adventure-fun-app",
        "img": "Doll_Dream_House_Adventure_Fun.jpg",
        "description": "Doll Dream House Adventure Fun lets you design and decorate your own dream dollhouse. From stylish furniture to adorable decorations, it's your chance to create the perfect home for your dolls in this imaginative and creative game."
    },
    {
        "name": "Green Heroes The urban experience just got a sustainable upgrade",
        "url": "https://cupidmobi.com/green-heroes-the-urban-experience-just-got-a-sustainable-upgrade-video",
        "img": "Green_Heroes_The_urban_experience_just_got_a_sustainable_upgrade.jpg",
        "description": "Meet the green heroes who are leading the charge towards a more sustainable and eco-friendly urban future. From architects and designers to activists and policymakers, these individuals are championing innovative solutions to combat climate change and create healthier, more livable cities for all."
    },
    {
        "name": "I'm a Celebrity Pet Luna is a prickly up-and-comer",
        "url": "https://cupidmobi.com/im-a-celebrity-pet-luna-is-a-prickly-up-and-comer-video",
        "img": "I'm_a_Celebrity_Pet_Luna_is_a_prickly_up-and-comer.jpg",
        "description": "Meet Luna, the spiky hedgehog who's stealing the spotlight as a celebrity pet on social media. With her adorable antics and charming personality, Luna has captured the hearts of thousands of fans worldwide, proving that even the prickliest of pets can be downright adorable."
    },
    {
        "name": "Physics Drawing",
        "url": "https://cupidmobi.com/physics-drawing-app",
        "img": "Physics_Drawing.jpg",
        "description": "Physics Drawing is a creative sandbox game where you can build and experiment with physics-based contraptions. Whether you're designing intricate machines or simply doodling with gravity, it's a fun and educational way to explore the principles of physics."
    },
    {
        "name": "Chainsaw Man Fighter",
        "url": "https://cupidmobi.com/chainsaw-man-fighter-app",
        "img": "Chainsaw_Man_Fighter.jpg",
        "description": "Chainsaw Man Fighter is an action-packed arcade game where you battle hordes of enemies with your trusty chainsaw. With fast-paced gameplay and intense combat, it's a thrilling test of reflexes and skill that will keep you on the edge of your seat."
    },
    {
        "name": "Color Combo",
        "url": "https://cupidmobi.com/color-combo-app",
        "img": "Color_Combo.jpg",
        "description": "Color Combo is a vibrant puzzle game where you match colors to create explosive combos and clear the board. With its colorful graphics and addictive gameplay, it's a fun and challenging way to test your reflexes and strategic thinking."
    },
    {
        "name": "Paint Color Match Puzzle Games",
        "url": "https://cupidmobi.com/paint-color-match-puzzle-games-app",
        "img": "Paint_Color_Match_Puzzle_Games.jpg",
        "description": "Paint Color Match Puzzle Games is a vibrant and engaging puzzle game where you match colors to complete beautiful paintings. With its relaxing gameplay and stunning visuals, it's the perfect way to unwind and unleash your creativity."
    },
    {
        "name": "Word Finder",
        "url": "https://cupidmobi.com/word-finder-game",
        "img": "Word_Finder.jpg",
        "description": "Word Finder is a captivating word search game where you hunt for hidden words within a grid of letters. With multiple game modes and customizable difficulty levels, it's a stimulating mental exercise that's perfect for word enthusiasts of all ages."
    },
    {
        "name": "Scientists have 'engineered' an enzyme that devours plastic",
        "url": "https://cupidmobi.com/scientists-have-engineered-an-enzyme-that-devours-plastic-video",
        "img": "Scientists_have_'engineered'_an_enzyme_that_devours_plastic.jpg",
        "description": "Researchers have developed a groundbreaking enzyme that has the ability to 'eat' plastic, offering a potential solution to the global plastic pollution crisis. With further development and optimization, this enzyme could revolutionize recycling efforts and help mitigate the environmental impact of plastic waste."
    },
    {
        "name": "Dogs Quiz",
        "url": "https://cupidmobi.com/dogs-quiz-game",
        "img": "Dogs_Quiz.jpg",
        "description": "Dogs Quiz is a fun and informative trivia game where you test your knowledge of man's best friend. With a wide range of questions and cute dog photos, it's a delightful way to learn more about different dog breeds and canine trivia."
    },
    {
        "name": "Valentine Love Mesh",
        "url": "https://cupidmobi.com/valentine-love-mesh-app",
        "img": "Valentine_Love_Mesh.jpg",
        "description": "Valentine Love Mesh is a romantic photo editing application designed to enhance your Valentine's Day photos. With various love-themed filters, frames, and stickers, it lets you create beautiful and memorable images to express your affection."
    },
    {
        "name": "Vegan Ice Cream Coconut Fusion",
        "url": "https://cupidmobi.com/vegan-ice-cream-coconut-fusion-video",
        "img": "Vegan_Ice_Cream_Coconut_Fusion.jpg",
        "description": "Indulge in the tropical flavors of coconut with this delicious vegan ice cream fusion. Made with creamy coconut milk and shredded coconut, it's a refreshing and dairy-free treat that's perfect for satisfying your sweet cravings on a hot day."
    },
    {
        "name": "Panzer Battle",
        "url": "https://cupidmobi.com/panzer-battle-app",
        "img": "Panzer_Battle.jpg",
        "description": "Panzer Battle immerses you in the heat of armored warfare as you command a tank battalion in intense battles. Strategize your attacks, outmaneuver enemy tanks, and lead your troops to victory in this adrenaline-fueled tank simulation game."
    },
    {
        "name": "Fire Lords",
        "url": "https://cupidmobi.com/fire-lords-app",
        "img": "Fire_Lords.jpg",
        "description": "Fire Lords is a thrilling strategy game where you command a mighty army of fire-breathing dragons. Conquer enemy territories, build your stronghold, and unleash the power of your dragons to dominate the battlefield in this epic fantasy adventure."
    },
    {
        "name": "Bull Fight",
        "url": "https://cupidmobi.com/bull-fight-game",
        "img": "Bull_Fight.jpg",
        "description": "Bull Fight is an adrenaline-fueled action game where you face off against raging bulls in the arena. With precise timing and skillful dodging, you must outmaneuver the bulls and survive the onslaught in this thrilling test of courage and agility."
    },
    {
        "name": "Inspire in a Minute From bullied bug hunter to kid author",
        "url": "https://cupidmobi.com/inspire-in-a-minute-from-bullied-bug-hunter-to-kid-author-video",
        "img": "Inspire_in_a_Minute_From_bullied_bug_hunter_to_kid_author.jpg",
        "description": "Discover the inspiring story of a young boy who overcame bullying and found his voice through his love of bugs. Now, as a published author and bug enthusiast, he's inspiring others to embrace their passions and pursue their dreams, no matter the obstacles they may face."
    },
    {
        "name": "Vegan Ice Cream Avocado Banana",
        "url": "https://cupidmobi.com/vegan-ice-cream-avocado-banana-video",
        "img": "Vegan_Ice_Cream_Avocado_Banana.jpg",
        "description": "Indulge in the creamy goodness of avocado banana vegan ice cream, made with ripe avocados, sweet bananas, and coconut milk. With its rich, velvety texture and tropical flavor, it's a guilt-free treat that's perfect for satisfying your sweet cravings on a hot summer day."
    }
]